[
    {
        "order": 1,
        "heading": "Front-end Engineering Intern",
        "link": " @ Genesys Upskill Community",
        "communityLink": "https://twitter.com/upskill_com",
        "text": "October 2020 - July 2021",
        "button": "Upskill",
        "lists": [
            "Collaborated with a cross-functional team of designers, back-end developers, and a product manager to create interactive features and functionalities, enhancing the overall usability and performance of a fintech App.",
            "Optimized the front-end codebase by refactoring and implementing efficient coding practices, resulting in a 20% improvement in page load times and overall application performance.",
            "Successfully integrated third-party APIs and libraries, such as the paystack payment gateway and data visualization tools, into the fintech app, expanding its functionality and enhancing user interactions.",
            "As the team lead on this project i Provided leadership within the frontend development team through close collaboration and knowledge sharing"
        ]
    },
    {
        "order": 3,
        "heading": "Front-end Engineer",
        "link": "Codename: Learnable",
        "communityLink": "https://www.genesystechhub.com/learnable",
        "text": "November 2021 - July 2022",
        "button": "Learnable",
        "lists": [
            "Working here equipped me with a deep understanding of agile methodologies, various front-end frameworks, and API integration, enabling me to deliver high-quality, user-centric solutions in a collaborative team environment.",
            "Developed responsive web pages and optimized it's user experience across different devices, enhancing accessibility and usage using HTML, CSS, JavaScript, ReactJS, Tailwind CSS and TypeScript.",
            "Worked closely with the back-end development team to design and consume REST APIs, ensuring seamless data retrieval and synchronization between the app's front-end and back-end components"
        ]
    },
    {
        "order": 2,
        "heading": "Front-end Engineer",
        "link": " @ Genesys Tech Hub",
        "communityLink": "https://www.genesystechhub.com/",
        "text": "October 2022 - present",
        "button": "Genesys",
        "lists": [
            "Collaborated with a team of software developers to build modern and responsive full stack software applications using tools like: JavaScript, React, Node, Express, MongoDB, HTML, TypeScript.",
            "Conducted thorough testing and debugging to ensure high-quality code and optimal performance for a for a full-stack web application.",
            "Proactively identified and resolved technical issues and bugs, minimizing project delays and improving overall efficiency."
        ]
    },
    {
        "order": 4,
        "heading": "Learning - Facilitator",
        "link": " @ Genesys CodeVille",
        "communityLink": "https://www.genesystechhub.com/codeville/",
        "text": "july 2023 - Present (Volunteer Experience)",
        "button": "CodeVille",
        "lists": [
            "As a passionate tech enthusiast and advocate for nurturing young talents, I'm having the incredible opportunity to participate in a rewarding program aimed at introducing children to the fascinating world of technology.",
            "Currently, I'm serveing as a learning facilitator, guiding and inspiring this group of bright young minds who are just beginning their journey in the world of tech.",
            "My primary role here is to teach these amazing kids the fundamentals of web development, focusing on HTML, CSS, and JavaScript. It is truly fulfilling to witness the enthusiasm and curiosity in the eyes of these young learners as they absorbe the knowledge I share with them on daily basis."
        ]
    }
]