[
    {
        "order": 1,
        "heading": "Web Development Intern",
        "link": " @ Genesy Upskill Community",
        "communityLink": "@ Upskill Community",
        "text": "October 2021 - July 2022",
        "button": "Upskill",
        "lists": [
            "Collaborated with a cross-functional team of designers, back-end developers, and a product manager to create interactive features and functionality, enhancing the overall usability and performance of a fintech App.",
            "Optimized the front-end codebase by refactoring and implementing efficient coding practices, resulting in a 20% improvement in page load times and overall application performance.",
            "Successfully integrated third-party APIs and libraries, such as payment gateways and data visualization tools, into the fintech app, expanding its functionality and enhancing user interactions.",
            "Provide leadership within the development department through close collaboration, knowledge shares, and mentorship"
        ]
    },
    {
        "order": 2,
        "heading": "Front-end Engineering Intern ",
        "link": " @ Genesys Tech Hub",
        "communityLink": "@ Upskill Community",
        "text": "November 2022 - July 2023",
        "button": "Learnable",
        "lists": [
            "Developed responsive web pages and optimized it's user experience across different devices, enhancing accessibility and usage using HTML, CSS, and ReactJS.",
            "Worked closely with the back-end development team to design and consume REST APIs, ensuring seamless data retrieval and synchronization between the app's front-end and back-end components..",
            "Interning here equipped me with a deep understanding of agile methodologies, various front-end frameworks, and API integration, enabling me to deliver high-quality, user-centric solutions in a collaborative team environment."
        ]
    },
    {
        "order": 3,
        "heading": "Web Dev Facilitator",
        "link": "@ Genesys Upskill Community",
        "communityLink": "@ Upskill Community",
        "text": "Febuary 2023 - July 2023",
        "button": "Genesys",
        "lists": [
            "Collaborated with a team to design and refine a comprehensive curriculum tailored to the needs of the mentees. This curriculum covered essential frontend web development technologies such as HTML, CSS, JavaScript, responsive design, and basic interaction with frontend frameworks.",
            "To simulate real-world experiences, I led my mentees in developing a collaborative frontend project. This project involved creating a responsive website for a Real estate website. It allowed the mentees to work in a team, understand version control with Git, and experience the challenges and joys of a real client project.",
            "Recognizing the diverse backgrounds and learning paces of my mentees, I offered personalized one-on-one sessions to address their queries, provide code reviews, and offer constructive feedback on their projects."
        ]
    }
]