[
    {
        "order": 1,
        "heading": "Front-end Engineering Intern",
        "link": " @ Genesys Upskill Community",
        "communityLink": "https://twitter.com/upskill_com",
        "text": "November 2022 - July 2023",
        "button": "Upskill",
        "lists": [
            "Collaborated with a cross-functional team to build interactive features and functionality for a fintech App During the course of my Internship here at Genesys Upskill Community",
            "Enhanced performance by 20% through front-end code optimization and efficient coding practices.",
            "Achieved a 20% faster page load times and performance achieved through front-end code optimization and efficient coding practices."
        ]
    },
    {
        "order": 2,
        "heading": "Front-end Engineering Intern",
        "link": "Codename: Learnable-22",
        "communityLink": "https://www.genesystechhub.com/learnable",
        "text": "November 2022 - July 2023",
        "button": "Learnable",
        "lists": [
            "Interning here equipped me with a deep understanding of agile methodologies, various front-end frameworks, and API integration techniques, enabling me to deliver high-quality, user-centric solutions in a collaborative team environment.",
            "Collaborated with the back-end team to create and utilize REST APIs, enabling seamless data retrieval and synchronization between the teams' project, front-end and back-end components.",
            "Developed responsive web pages and optimized it's user experience across different devices, enhancing accessibility and usage using HTML, CSS, JavaScript, ReactJS, Tailwind CSS and TypeScript."
        ]
    },
    {
        "order": 3,
        "heading": "Frontend developer",
        "link": " @ Enugu State Tech Hub",
        "communityLink": "https://www.enugutechhub.en.gov.ng/",
        "text": "August 2023 - Present",
        "button": "ESTH",
        "lists": [
            "Collaborated with a team of software developers to build modern and responsive full stack software applications using tools like: JavaScript, React, Node, Express, MongoDB, HTML, TypeScript, for the Enugu State Tech Hub.",
            "Conducted thorough testing and debugging to ensure high-quality code and optimal performance for the e-governance platform we built during my stay here."
        ]
    },
    {
        "order": 4,
        "heading": "Learning - Facilitator",
        "link": " @ Genesys CodeVille",
        "communityLink": "https://www.genesystechhub.com/codeville/",
        "text": "July 2023 - Present (Volunteer Experience)",
        "button": "CodeVille",
        "lists": [
            "As a passionate tech enthusiast and advocate for nurturing young talents, I'm having the incredible opportunity to participate in a rewarding program aimed at introducing children to the fascinating world of technology.",
            "Currently, I'm serveing as a learning facilitator, guiding and inspiring this group of bright young minds who are just beginning their journey in the world of tech.",
            "My primary role here is to teach these amazing kids the fundamentals of web development, focusing on HTML, CSS, and JavaScript. It is truly fulfilling to witness the enthusiasm and curiosity in the eyes of these young learners as they absorbe the knowledge I share with them on daily basis."
        ]
    }
]